app/Controllers/admin.php

    public function updateUser()
    {
        if (! $this->request->is('post')) {
            return $this->response->setStatusCode(405);
        }

        // Only admins may update user data
        if (! session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        }

        $id = intval($this->request->getPost('id'));
    $name = $this->request->getPost('name');
    $email = $this->request->getPost('email');
    $role = $this->request->getPost('role');
    $password = $this->request->getPost('password'); // optional

        $db = \Config\Database::connect();
        $builder = $db->table('users');

        $user = $builder->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = 6

    public function getCourses()
    {
        // Only admins can view all courses
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized']);
        }

        try {
            $db = \Config\Database::connect();

            // Check if units column exists
            $fields = $db->getFieldNames('courses');
            $hasUnits = in_array('units', $fields);

            // Build query based on column availability
            if ($hasUnits) {
                $courses = $db->table('courses')
                    ->select('courses.id, courses.subject_code as course_code, courses.subject_name as course_name, courses.description, courses.units, courses.semester, courses.instructor_id, users.name as teacher_name, courses.created_at')
                    ->join('users', 'users.id = courses.instructor_id', 'left')
                    ->orderBy('courses.created_at', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`subject_code` as `course_code`, `courses`.`subject_name` as `course_name`, `courses`.`description`, `courses`.`units`, `courses`.`semester`, `courses`.`instructor_id`, `users`.`name` as `teacher_name`, `courses`.`created_at`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
ORDER BY `courses`.`created_at` DESC