app/Controllers/Auth.php

public function dashboard()
{
    // Authorization check
    if (!session()->get('isLoggedIn')) {
        return redirect()->to(base_url('login'));
    }

    $role = session()->get('role');
    $db = \Config\Database::connect();

    $data = [
        'role' => $role,
        'name' => session()->get('name')
    ];

    if ($role === 'admin') {
        $data['totalUsers']   = $db->table('users')->countAllResults();
        $data['totalCourses'] = $db->table('courses')->countAllResults();
        $data['users'] = $db->table('users')->get()->getResultArray();
        $data['coursesList'] = $db->table('courses')
            ->select('id, course_name AS name, description')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT *
FROM `users`
SELECT `id`, `course_name` AS `name`, `description`
FROM `courses`

                ->getResultArray();
        }
    }
    $data['coursesList'] = $db->table('courses')->get()->getResultArray();
---
SELECT *
FROM `courses`