app/Controllers/Auth.php

        // Get enrolled courses with details
        /** @var BaseBuilder $enrollmentsBuilder */
        $enrollmentsBuilder = $db->table('enrollments');
        $data['enrolledCourses'] = $enrollmentsBuilder
            ->select('courses.id, courses.subject_code as code, courses.subject_name as name, courses.description, courses.semester, enrollments.enrollment_date')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where("enrollments.{$enrollmentUserCol}", session()->get('userID'))
            ->where('enrollments.status', 'enrolled')
            ->get()
            ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`subject_code` as `code`, `courses`.`subject_name` as `name`, `courses`.`description`, `courses`.`semester`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '5'
AND `enrollments`.`status` = 'enrolled'

        if (! empty($enrolledCourseIds)) {
            // Fetch materials for enrolled courses
            $materialModel = new MaterialModel();
            $materials = $materialModel->whereIn('course_id', $enrolledCourseIds)
                ->orderBy('created_at', 'DESC')
                ->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` IN ('5','9')
ORDER BY `created_at` DESC

            $data['courseMaterials'] = $courseMaterials;

            // Get assigned/pending/rejected courses for this student
            $assignedCourses = $db->table('enrollments')
                ->select('courses.id, courses.subject_code as code, courses.subject_name as name, courses.description, courses.semester, enrollments.status')
                ->join('courses', 'courses.id = enrollments.course_id')
                ->where("enrollments.{$enrollmentUserCol}", session()->get('userID'))
                ->whereIn('enrollments.status', ['assigned', 'pending', 'rejected'])
                ->get()
                ->getResultArray();
---
SELECT `courses`.`id`, `courses`.`subject_code` as `code`, `courses`.`subject_name` as `name`, `courses`.`description`, `courses`.`semester`, `enrollments`.`status`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '5'
AND `enrollments`.`status` IN ('assigned','pending','rejected')

    }
    /** @var BaseBuilder $coursesListBuilder */
    $coursesListBuilder = $db->table('courses');
    $data['coursesList'] = $coursesListBuilder->get()->getResultArray();
---
SELECT *
FROM `courses`