app/Controllers/Materials.php

SELECT *
FROM `materials`
WHERE `course_id` = 2
ORDER BY `created_at` DESC
---
    public function courseMaterials($course_id)
    {
        try {
            $sess = session();
            log_message('debug', 'Materials::courseMaterials called for course_id=' . intval($course_id) . ' session=' . json_encode($sess->get()) );

            if (! $sess->get('isLoggedIn')) {
                return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized'])->setStatusCode(401);
            }

            $model = new \App\Models\MaterialModel();
            $materials = $model->where('course_id', (int)$course_id)->orderBy('created_at','DESC')->findAll();