app/Controllers/Teacher.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '9'
SELECT `users`.`id`, `users`.`name`, `users`.`email`, `enrollments`.`enrollment_date`, `enrollments`.`status`, `enrollments`.`id` as `enrollment_id`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '9'
AND `enrollments`.`status` IN ('enrolled','pending')
---
    public function getCourseStudents($courseId)
    {
        $session = session();
        if (!$session->get('isLoggedIn') || $session->get('role') !== 'teacher') {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Unauthorized'])->setStatusCode(401);
        }

        $teacherId = $session->get('userID');
        $course = $this->courseModel->find($courseId);

        if (!$course || $course['instructor_id'] != $teacherId) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Access denied'])->setStatusCode(403);
        }

        $db = \Config\Database::connect();
        $students = $db->table('enrollments')
            ->select('users.id, users.name, users.email, enrollments.enrollment_date, enrollments.status, enrollments.id as enrollment_id')
            ->join('users', 'users.id = enrollments.user_id')
            ->where('enrollments.course_id', $courseId)
            ->whereIn('enrollments.status', ['enrolled', 'pending'])
            ->get()
            ->getResultArray();