app/Models/AssignmentModel.php

SELECT `assignments`.*, COUNT(student_submissions.id) as submission_count
FROM `assignments`
LEFT JOIN `student_submissions` ON `student_submissions`.`assignment_id` = `assignments`.`id`
WHERE `assignments`.`course_id` = '5'
GROUP BY `assignments`.`id`
ORDER BY `assignments`.`created_at` DESC
---
    public function getAssignmentsWithSubmissionCount($courseId)
    {
        $db = \Config\Database::connect();
        return $db->table($this->table)
            ->select('assignments.*, COUNT(student_submissions.id) as submission_count')
            ->join('student_submissions', 'student_submissions.assignment_id = assignments.id', 'left')
            ->where('assignments.course_id', $courseId)
            ->groupBy('assignments.id')
            ->orderBy('assignments.created_at', 'DESC')
            ->get()
            ->getResultArray();