app/Models/CourseModel.php

SELECT `courses`.`id`, `courses`.`subject_code`, `courses`.`subject_name`, `courses`.`description`, `courses`.`semester`, `courses`.`instructor_id`, `courses`.`created_at`, `courses`.`updated_at`, COUNT(DISTINCT enrollments.id) as enrolled_count
FROM `courses`
LEFT JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id`
WHERE `courses`.`instructor_id` = '4'
GROUP BY `courses`.`id`
ORDER BY `courses`.`subject_name` ASC
---
    public function getTeacherCoursesWithStats($instructorId)
    {
        $db = \Config\Database::connect();

        // Check which column names exist in the table
        $fields = $db->getFieldNames('courses');
        $hasSubjectCode = in_array('subject_code', $fields);
        $hasCourseCode = in_array('course_code', $fields);

        // Build select statement based on available columns
        if ($hasSubjectCode) {
            $select = 'courses.id, courses.subject_code, courses.subject_name, courses.description, courses.semester, courses.instructor_id, courses.created_at, courses.updated_at, COUNT(DISTINCT enrollments.id) as enrolled_count';
        } else {
            $select = 'courses.id, courses.course_code as subject_code, courses.course_name as subject_name, courses.description, courses.semester, courses.instructor_id, courses.created_at, courses.updated_at, COUNT(DISTINCT enrollments.id) as enrolled_count';
        }

        return $db->table($this->table)
            ->select($select)
            ->join('enrollments', 'enrollments.course_id = courses.id', 'left')
            ->where('courses.instructor_id', $instructorId)
            ->groupBy('courses.id')
            ->orderBy($hasSubjectCode ? 'courses.subject_name' : 'courses.course_name', 'ASC')
            ->get()
            ->getResultArray();