app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('3', '5', '2025-10-07 16:14:32')
---
    public function enrollUser($data)
    {
        return $this->insert($data);

SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '3'
AND `course_id` = '5'
---
    public function isAlreadyEnrolled($user_id, $course_id)
    {
        return $this->where([
            'user_id' => $user_id,
            'course_id' => $course_id
        ])->countAllResults() > 0;